In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.read_csv(filepath_or_buffer='../../pandas-workout-data/data/nyc-temps.txt').squeeze()
s

0     -1
1     -1
2     -1
3     -1
4     -1
      ..
723    2
724    2
725    2
726    2
727    2
Name: -1, Length: 728, dtype: int64

In [3]:
df = pd.DataFrame({
    'temp': s,
    'hour': [0,3,6,9,12,15,18,21] * 91
})
df

     temp  hour
0      -1     0
1      -1     3
2      -1     6
3      -1     9
4      -1    12
..    ...   ...
723     2     9
724     2    12
725     2    15
726     2    18
727     2    21

[728 rows x 2 columns]

In [4]:
# Get the mean + mediam for baseline data
df['temp'].describe()

count    728.000000
mean      -1.050824
std        5.026357
min      -14.000000
25%       -4.000000
50%        0.000000
75%        2.000000
max       12.000000
Name: temp, dtype: float64

In [5]:
#0df.loc[(df['hour'] == 3) | (df['hour'] == 6), 'temp'] = np.nan
#df
df.loc[df['hour'].isin([3,6]), 'temp'] = np.nan
df

     temp  hour
0    -1.0     0
1     NaN     3
2     NaN     6
3    -1.0     9
4    -1.0    12
..    ...   ...
723   2.0     9
724   2.0    12
725   2.0    15
726   2.0    18
727   2.0    21

[728 rows x 2 columns]

In [6]:
df['temp'].count()

np.int64(546)

In [7]:
df

     temp  hour
0    -1.0     0
1     NaN     3
2     NaN     6
3    -1.0     9
4    -1.0    12
..    ...   ...
723   2.0     9
724   2.0    12
725   2.0    15
726   2.0    18
727   2.0    21

[728 rows x 2 columns]

In [8]:
df = df.interpolate(method='linear')
df

     temp  hour
0    -1.0     0
1    -1.0     3
2    -1.0     6
3    -1.0     9
4    -1.0    12
..    ...   ...
723   2.0     9
724   2.0    12
725   2.0    15
726   2.0    18
727   2.0    21

[728 rows x 2 columns]

In [10]:
df['temp'].describe()

count    728.000000
mean      -1.050824
std        5.026357
min      -14.000000
25%       -4.000000
50%        0.000000
75%        2.000000
max       12.000000
Name: temp, dtype: float64